# Importación de librerias

In [36]:
import pandas as pd
import plotly.offline as pyo
import plotly.graph_objs as go

# Scatter plot

In [37]:
df_iris = pd.read_csv('datasets/iris.csv')
df_iris.head(3)

   sepal.length  sepal.width  petal.length  petal.width variety
0           5.1          3.5           1.4          0.2  Setosa
1           4.9          3.0           1.4          0.2  Setosa
2           4.7          3.2           1.3          0.2  Setosa

In [38]:
data1 = [go.Scatter(x=df_iris['sepal.length'], 
                    y = df_iris['sepal.width'],
                    mode = "markers")]

layout1 = go.Layout(title="Iris scatter plot",
                     xaxis={"title":"sepal length"},
                     yaxis={"title":"sepal width"})

In [39]:
fig = go.Figure(data=data1, layout=layout1)
pyo.plot(fig, filename="plot_iris_scatter.html")

'plot_iris_scatter.html'

# Lines plot

In [40]:
df_sp500 = pd.read_csv('datasets/SP500_data.csv')
df_sp500.head(3)

         Date       Open       High        Low      Close  Adj Close  Volume
0  1928-01-03  17.760000  17.760000  17.760000  17.760000  17.760000       0
1  1928-01-04  17.719999  17.719999  17.719999  17.719999  17.719999       0
2  1928-01-05  17.549999  17.549999  17.549999  17.549999  17.549999       0

In [41]:
traza1 = go.Scatter(x = df_sp500['Date'], 
                    y = df_sp500['Open'],
                    mode = "lines+markers")

traza2 = go.Scatter(x = df_sp500['Date'],
                    y = df_sp500['Close'],
                    mode = 'lines+markers')
data2 = [traza1, traza2]

layout2 = go.Layout(title = 'SP500 line plot',
                    xaxis = dict(title = 'date'),
                    yaxis = dict(title = 'close'))

In [42]:
fig = go.Figure(data = data2, layout=layout2)
pyo.plot(fig, filename = "plot_sp500_line_plot.html")

'plot_sp500_line_plot.html'

# Bar plot

In [43]:
df_ventas = pd.read_csv('datasets/Ventas.csv', sep = ';')
df_ventas.head(10)

,Fecha,Total Venta Classic Cars,Total Venta Motorcycles,Total Venta Planes,Total Venta Ships,Total Venta Trains,Total Venta Trucks and Buses,Total Venta Vintage Cars
0,ene-21,198555,66199,103496.0,69068.0,NaN,101661.0,76212
1,feb-21,220266,107584,50660.0,46688.0,22295.0,7973.0,75539
2,mar-21,216497,158174,168445.0,2353.0,5234.0,71864.0,80267
3,abr-21,267449,52374,20541.0,NaN,NaN,51155.0,60920
4,may-21,285155,51863,NaN,NaN,25326.0,64369.0,67898
5,jun-21,248718,35949,23113.0,56841.0,20311.0,42555.0,83544
6,jul-21,50876,74319,NaN,47271.0,8153.0,NaN,29008
7,ago-21,123039,88478,27227.0,27390.0,11402.0,41791.0,46291
8,sep-21,174256,6535,13368.0,25508.0,8771.0,46697.0,122563
9,oct-21,225774,72539,90772.0,37893.0,NaN,45272.0,96830

In [44]:
traza1 = go.Scatter(x = df_ventas['Fecha'],
                    y = df_ventas['Total Venta Classic Cars'],
                    mode = 'lines',
                    name = 'Classic Cars')
traza2 = go.Scatter(x = df_ventas['Fecha'],
                    y = df_ventas['Total Venta Motorcycles'],
                    mode = 'lines',
                    name = 'Motorcycles')
data3 = [traza1, traza2]

layoud3 = go.Layout(title = 'Line plot Ventas Classic Cars vs Motorcycles',
                    xaxis = dict(title = 'Fecha'),
                    yaxis = dict(title = 'Total ventas'))
fig = go.Figure(data = data3, layout=layoud3)

In [45]:
pyo.plot(fig, filename='lines_plot_Ventas_Classic_cars_vs_Motorcycles.html')

'lines_plot_Ventas_Classic_cars_vs_Motorcycles.html'

In [46]:
df_medallas = pd.read_excel('datasets/Medallas_olimpicas.xlsx')
df_medallas.head(10)

                       País   Oro  Plata  Bronce  Total
0      Estados Unidos (USA)  1022    794     704   2520
1     Unión Soviética (URS)   395    319     296   1010
2         Reino Unido (GBR)   263    295     289    847
3               China (CHN)   227    163     153    543
4            Alemania (GER)   219    246     269    734
5             Francia (FRA)   212    241     260    713
6              Italia (ITA)   208    178     193    579
7             Hungría (HUN)   175    147     169    491
8               Rusia (RUS)   153    143     164    460
9   Alemania Oriental (RDA)   153    129     127    409

In [47]:
df_medallas = df_medallas.sort_values(by = 'Total', ascending = False)

In [48]:
data4 = [go.Bar(x = df_medallas['País'], 
                y = df_medallas['Total'])]
layout4 = go.Layout(title = 'Medallas por país',
                    xaxis = dict(title = "País"),
                    yaxis = dict(title = 'Total medallas'))
fig = go.Figure(data = data4, layout=layout4)

In [49]:
pyo.plot(fig, filename='plot_bar_medallas.html')

'plot_bar_medallas.html'

In [52]:
traza1 = go.Bar(x = df_medallas['País'],
                y = df_medallas['Oro'],
                marker = {"color":"#FFD700"},
                name = 'Oro')
traza2 = go.Bar(x = df_medallas['País'],
                y = df_medallas['Plata'],
                marker = {"color":"#c0c0c0"},
                name = 'Plata')
traza3 = go.Bar(x = df_medallas['País'],
                y = df_medallas['Bronce'],
                marker = {"color":"#CD7F32"},
                name = 'Bronce')

data5 = [traza1, traza2, traza3]

layout5 = go.Layout(title = 'Medallas por país bar plot',
                    xaxis = dict(title = 'País'),
                    yaxis = dict(title = 'Medallas'),
                    barmode = 'stack')

fig = go.Figure(data=data5, layout=layout5)

In [53]:
pyo.plot(fig, filename='plot_bar_medallas_trazas.html')

'plot_bar_medallas_trazas.html'

# Bubble plot

In [55]:
df_info_pais = pd.read_excel('datasets/Info_pais.xlsx')
df_info_pais.head(5)

,País,Continente,Poblacion,Renta per capita,Esperanza de vida
0,United States,North America,325084756,59939,78.9
1,China,Asia,1421021791,8612,76.7
2,Japan,Asia,127502725,38214,84.5
3,Germany,Europe,82658409,44680,81.2
4,India,Asia,1338676785,1980,69.4

In [56]:
df_info_pais['Continente'].unique()

array(['North America', 'Asia', 'Europe', 'South America', 'Oceania',
       'Africa'], dtype=object)

In [65]:
dic_cont_color = {'North America':'green', 'South America': 'green', 'Oceania': 'brown', 'Europe':'blue', 'Africa': 'gray', 'Asia': 'red'}

In [66]:
df_info_pais['color'] = df_info_pais['Continente'].map(dic_cont_color)
df_info_pais[:10]

,País,Continente,Poblacion,Renta per capita,Esperanza de vida,color
0,United States,North America,325084756,59939,78.9,green
1,China,Asia,1421021791,8612,76.7,red
2,Japan,Asia,127502725,38214,84.5,red
3,Germany,Europe,82658409,44680,81.2,blue
4,India,Asia,1338676785,1980,69.4,red
5,United Kingdom,Europe,66727461,39532,81.2,blue
6,France,Europe,64842509,39827,82.5,blue
7,Brazil,South America,207833823,9881,75.7,green
8,Italy,Europe,60673701,32038,83.6,blue
9,Canada,North America,36732095,44841,82.3,green

In [71]:
data6 = [go.Scatter(x = df_info_pais['Renta per capita'], 
                    y = df_info_pais['Esperanza de vida'],
                    text = df_info_pais['País'],
                    mode = 'markers',
                    marker = dict(
                        size = df_info_pais['Poblacion']/5000000,
                        color = df_info_pais['color']
                    ))]

layout6 = go.Layout(title='Bubble plot Renta per capita vs Esperanza de vida',
                    xaxis = dict(title = 'Renta per capita'),
                    yaxis = dict(title = 'Esperanza de vida'))

fig = go.Figure(data = data6, layout=layout6)

In [72]:
pyo.plot(fig, filename = 'bubble_plot.html')

'bubble_plot.html'

# Box plot

In [76]:
datos = [1, 5, 7, 87, 4, 2, 3, 5, 9 , 10, 16, 24, -10, 3, 5 , 8]

In [77]:
data7 = [go.Box(y = datos)]
layout7 = go.Layout(title = 'Box plot')
fig = go.Figure(data=data7, layout=layout7)

In [78]:
pyo.plot(fig, filename='box_plot.html')

'box_plot.html'

In [79]:
df_temperaturas = pd.read_excel('datasets/Temperaturas.xlsx')
df_temperaturas.head(5)

       FECHA  Ciudad  T, Máxima  T,Mínima  T_Promedio
0 2019-06-01  Madrid       33.1      17.2       25.15
1 2019-06-02  Madrid       34.5      19.0       26.75
2 2019-06-03  Madrid       32.8      20.3       26.55
3 2019-06-04  Madrid       29.0      18.9       23.95
4 2019-06-05  Madrid       22.1      12.7       17.40

In [80]:
data8 = [go.Box(x = df_temperaturas['Ciudad'],
               y = df_temperaturas['T_Promedio'])]

layout8 = go.Layout(title = 'Box plot temperatura para cada ciudad')

fig = go.Figure(data=data8, layout=layout8)

In [81]:
pyo.plot(fig, filename='blox_plot_ejer.html')

'blox_plot_ejer.html'

# Histogram

In [83]:
df_temperaturas2 = pd.read_excel('datasets/Temperaturas.xlsx')
df_temperaturas2.head(5)

       FECHA  Ciudad  T, Máxima  T,Mínima  T_Promedio
0 2019-06-01  Madrid       33.1      17.2       25.15
1 2019-06-02  Madrid       34.5      19.0       26.75
2 2019-06-03  Madrid       32.8      20.3       26.55
3 2019-06-04  Madrid       29.0      18.9       23.95
4 2019-06-05  Madrid       22.1      12.7       17.40

In [88]:
data9 = [go.Histogram(x = df_temperaturas2['T_Promedio'], 
                      xbins=dict(start = 0, end = 40, size = 5), 
                      histnorm='probability',
                      cumulative_enabled = True)]

layout9 = go.Layout(title = 'Histogram T_Promedio')

fig = go.Figure(data=data9, layout=layout9)

In [89]:
pyo.plot(fig, filename='Histogram_plot.html')

'Histogram_plot.html'